Revit 2027 API
RebarShapeDrivenAccessor.FlipRebar Method
 Flips the rebar by flipping the ends and the bar segments.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void FlipRebar()
Public Sub FlipRebar
public:
void FlipRebar()
member FlipRebar : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference. -or- This RebarShapeDrivenAccessor is an instance of a spiral shape.
Remarks
 This method flips the curve loop of the rebar, changing start with end, and segment i with segment n - i - 1 (with i from 0 up to n - 1). This method is not applicable for a spiral shaped rebar.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace